package com.github.xuchen93.es.learn.util;

import cn.hutool.core.collection.CollUtil;
import cn.hutool.core.util.RandomUtil;
import cn.hutool.json.JSONArray;
import cn.hutool.json.JSONObject;
import cn.hutool.json.JSONUtil;
import lombok.Data;

import java.util.ArrayList;
import java.util.List;
import java.util.stream.Collectors;

/**
 * @author xuchen.wang
 * @date 2023/10/9
 */
public class CommonUtil {

    private static final String s = "[{\"city\":[\"乌兰察布\",\"鄂尔多斯\",\"海拉尔\",\"临河\",\"呼和浩特\",\"包头\",\"阿拉善\",\"锡林浩特\",\"赤峰\",\"集宁\",\"通辽\",\"兴安\",\"乌海\",\"巴彦淖尔\",\"乌兰浩特\",\"呼伦贝尔\",\"锡林郭勒\"],\"province\":\"内蒙古\"},{\"city\":[\"怒江\",\"玉溪\",\"昭通\",\"保山\",\"楚雄\",\"迪庆\",\"丽江\",\"临沧\",\"大理\",\"思茅\",\"昆明\",\"曲靖\",\"西双版纳\",\"红河\",\"德宏\",\"普洱\",\"文山\"],\"province\":\"云南\"},{\"city\":[\"阜阳\",\"淮北\",\"淮南\",\"六安\",\"蚌埠\",\"亳州\",\"滁州\",\"铜陵\",\"合肥\",\"宣城\",\"安庆\",\"马鞍山\",\"黄山\",\"池州\",\"宿州\",\"芜湖\"],\"province\":\"安徽\"},{\"city\":[\"温州\",\"丽水\",\"嘉兴\",\"湖州\",\"杭州\",\"台州\",\"衢州\",\"绍兴\",\"宁波\",\"舟山\",\"金华\"],\"province\":\"浙江\"},{\"city\":[\"威海\",\"泰安\",\"济宁\",\"淄博\",\"菏泽\",\"东营\",\"聊城\",\"德州\",\"临沂\",\"潍坊\",\"青岛\",\"日照\",\"枣庄\",\"烟台\",\"滨州\",\"济南\"],\"province\":\"山东\"},{\"city\":[\"万州\",\"涪陵\",\"黔江\",\"重庆\"],\"province\":\"重庆\"},{\"city\":[\"东莞\",\"茂名\",\"揭阳\",\"梅州\",\"深圳\",\"江门\",\"中山\",\"肇庆\",\"珠海\",\"潮州\",\"广州\",\"佛山\",\"阳江\",\"汕尾\",\"汕头\",\"韶关\",\"清远\",\"惠州\",\"湛江\",\"河源\",\"云浮\"],\"province\":\"广东\"},{\"city\":[\"共和\",\"海东\",\"德令哈\",\"西宁\",\"海晏\",\"果洛\",\"黄南\",\"海南\",\"玉树\",\"格尔木\",\"海西\",\"海北\"],\"province\":\"青海\"},{\"city\":[\"扬州\",\"徐州\",\"南京\",\"苏州\",\"宿迁\",\"无锡\",\"泰州\",\"镇江\",\"南通\",\"盐城\",\"淮安\",\"连云港\",\"常州\"],\"province\":\"江苏\"},{\"city\":[\"吉安\",\"鹰潭\",\"上饶\",\"南昌\",\"景德镇\",\"九江\",\"赣州\",\"萍乡\",\"抚州\",\"新余\",\"宜春\"],\"province\":\"江西\"},{\"city\":[\"南充\",\"遂宁\",\"泸州\",\"宜宾\",\"甘孜\",\"巴中\",\"雅安\",\"广元\",\"达州\",\"内江\",\"攀枝花\",\"凉山\",\"西昌\",\"眉山\",\"绵阳\",\"德阳\",\"广安\",\"阿坝\",\"成都\",\"达县\",\"自贡\",\"资阳\",\"乐山\"],\"province\":\"四川\"},{\"city\":[\"营口\",\"朝阳\",\"盘锦\",\"本溪\",\"阜新\",\"铁岭\",\"大连\",\"鞍山\",\"辽阳\",\"丹东\",\"锦州\",\"葫芦岛\",\"沈阳\",\"抚顺\"],\"province\":\"辽宁\"},{\"city\":[\"河池\",\"钦州\",\"崇左\",\"百色\",\"贺州\",\"玉林\",\"南宁\",\"来宾\",\"梧州\",\"柳州\",\"贵港\",\"防城港\",\"北海\",\"桂林\"],\"province\":\"广西\"},{\"city\":[\"临汾\",\"晋中\",\"晋城\",\"忻州\",\"阳泉\",\"太原\",\"大同\",\"吕梁\",\"朔州\",\"长治\",\"运城\"],\"province\":\"山西\"},{\"city\":[\"塔城\",\"克州\",\"吐鲁番\",\"乌鲁木齐\",\"石河子\",\"博乐\",\"昌吉\",\"克拉玛依\",\"伊犁\",\"和田\",\"博尔塔拉\",\"哈密\",\"喀什\",\"阿勒泰\",\"阿克苏\",\"巴音郭楞\",\"克孜勒苏\",\"奎屯\",\"库尔勒\",\"巴州\"],\"province\":\"新疆\"},{\"city\":[\"随州\",\"神农架\",\"潜江\",\"武汉\",\"孝感\",\"仙桃\",\"黄冈\",\"黄石\",\"襄阳\",\"十堰\",\"咸宁\",\"鄂州\",\"恩施\",\"宜昌\",\"荆州\",\"江汉\",\"荆门\"],\"province\":\"湖北\"},{\"city\":[\"潢川\",\"焦作\",\"开封\",\"鹤壁\",\"济源\",\"濮阳\",\"新乡\",\"三门峡\",\"平顶山\",\"郑州\",\"周口\",\"驻马店\",\"商丘\",\"洛阳\",\"南阳\",\"安阳\",\"漯河\",\"信阳\",\"许昌\"],\"province\":\"河南\"},{\"city\":[\"昌都\",\"林芝\",\"那曲\",\"拉萨\",\"山南\",\"阿里\",\"日喀则\"],\"province\":\"西藏\"},{\"city\":[\"齐齐哈尔\",\"牡丹江\",\"黑河\",\"七台河\",\"大兴安岭\",\"鹤岗\",\"双鸭山\",\"哈尔滨\",\"鸡西\",\"绥化\",\"伊春\",\"大庆\",\"佳木斯\"],\"province\":\"黑龙江\"},{\"city\":[\"梅河口\",\"长春\",\"辽源\",\"延吉\",\"白城\",\"四平\",\"延边\",\"白山\",\"松原\",\"吉林\",\"珲春\",\"通化\"],\"province\":\"吉林\"},{\"city\":[\"凯里\",\"安顺\",\"遵义\",\"贵阳\",\"黔南\",\"毕节\",\"六盘水\",\"黔西南\",\"黔东南\",\"铜仁\",\"兴义\",\"都匀\"],\"province\":\"贵州\"},{\"city\":[\"金昌\",\"定西\",\"张掖\",\"天水\",\"平凉\",\"临夏\",\"庆阳\",\"陇南\",\"酒泉\",\"兰州\",\"武威\",\"嘉峪关\",\"甘南\",\"白银\"],\"province\":\"甘肃\"},{\"city\":[\"泉州\",\"莆田\",\"漳州\",\"龙岩\",\"三明\",\"厦门\",\"宁德\",\"福州\",\"南平\"],\"province\":\"福建\"},{\"city\":[\"邵阳\",\"益阳\",\"娄底\",\"吉首\",\"湘潭\",\"郴州\",\"怀化\",\"岳阳\",\"株洲\",\"长沙\",\"衡阳\",\"永州\",\"常德\",\"湘西\",\"张家界\"],\"province\":\"湖南\"},{\"city\":[\"西安\",\"汉中\",\"渭南\",\"延安\",\"榆林\",\"安康\",\"铜川\",\"商洛\",\"宝鸡\",\"商州\",\"咸阳\"],\"province\":\"陕西\"},{\"city\":[\"廊坊\",\"衡水\",\"邢台\",\"雄安\",\"邯郸\",\"承德\",\"张家口\",\"秦皇岛\",\"保定\",\"唐山\",\"石家庄\",\"沧州\"],\"province\":\"河北\"},{\"city\":[\"北京\"],\"province\":\"北京\"},{\"city\":[\"海口\",\"三亚\"],\"province\":\"海南\"},{\"city\":[\"石嘴山\",\"银川\",\"固原\",\"中卫\",\"吴忠\"],\"province\":\"宁夏\"},{\"city\":[\"上海\"],\"province\":\"上海\"},{\"city\":[\"天津\"],\"province\":\"天津\"},{\"city\":[\"其他\"],\"province\":\"其他\"}]";
    private static final List<Area> areaList = JSONUtil.toList(s,Area.class);

    public static Area randomArea(){
        return areaList.get(RandomUtil.randomInt(areaList.size()));
    }

    @Data
    public static class Area{
        private String province;
        private List<String> city;

        public String randomCity(){
            return city.get(RandomUtil.randomInt(city.size()));
        }
    }
}
